app/views/posts/homepage.html.erb

SELECT "posts".* FROM "posts"
---
  <tbody>
  <% Post.all.each do |post| %>