app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.user = current_user

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("content", "title", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "dasasddsa"], ["title", "dsadasdasddasdsa"], ["created_at", "2018-06-12 23:28:32.233909"], ["updated_at", "2018-06-12 23:28:32.233909"], ["user_id", 2]]